reddit_on_rails/app/controllers/subs_controller.rb

  def create
    @sub = Sub.new(sub_params)
    @sub.mod_id = current_user.id
    if @sub.save
---
INSERT INTO "subs" ("title", "description", "mod_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "Outside"], ["description", "the free to play MMO"], ["mod_id", 1], ["created_at", "2018-09-18 21:49:47.263521"], ["updated_at", "2018-09-18 21:49:47.263521"]]