reddit_on_rails/app/views/subs/index.html.erb

SELECT "subs".* FROM "subs"
---

<% Sub.all.each do |sub1| %>