reddit_on_rails/app/views/subs/show.html.erb

<br>
<% @sub.posts.each do |post| %>
---
SELECT "posts".* FROM "posts" WHERE "posts"."sub_id" = $1  [["sub_id", 1]]