reddit_on_rails/app/models/user.rb

SELECT  "users".* FROM "users" WHERE "users"."session_token" = $1 LIMIT $2  [["session_token", "rJJ-YxC44QCneOez5lQitg"], ["LIMIT", 1]]
---
  def self.find_by_session_token(sess)
    User.find_by(session_token: sess)